mlsorensen/Apollo2/src/platform_esp32/display.cpp
void flush_cb(lv_display_t* disp, const lv_area_t* area, uint8_t* px_map) {
  const uint32_t w = lv_area_get_width(area);
  const uint32_t h = lv_area_get_height(area);
  // Arduino_GFX's draw16bitRGBBitmap takes native-order RGB565 (works for both
  // the SPI and RGB backends); no lv_draw_sw_rgb565_swap needed.
  g_gfx->draw16bitRGBBitmap(area->x1, area->y1, reinterpret_cast<uint16_t*>(px_map),
                            w, h);
  lv_display_flush_ready(disp);
}

}  // namespace

namespace platform {

bool Display::begin() {
#if defined(BOARD_DISPLAY_DSI)
  // MIPI-DSI panel (the P4 4.3"), direct esp_lcd — NOT Arduino_GFX — so the
  // DPI layer can own TWO framebuffers (dsi_flush_cb above presents tear-free
  // on the frame boundary). Sequence per the IDF DSI examples & Waveshare BSP:
  // PHY LDO on -> DSI bus -> DBI channel for the ST7701 DCS init -> DPI panel.
  esp_ldo_channel_handle_t ldo = nullptr;
  esp_ldo_channel_config_t ldo_cfg = {};
  ldo_cfg.chan_id = 3;  // LDO_VO3 feeds VDD_MIPI_DPHY on this board
  ldo_cfg.voltage_mv = 2500;
  if (esp_ldo_acquire_channel(&ldo_cfg, &ldo) != ESP_OK) {
    Serial.println("DSI: MIPI PHY LDO acquire FAILED");
    return false;
  }

  esp_lcd_dsi_bus_config_t bus_cfg = {};
  bus_cfg.bus_id = 0;
  bus_cfg.num_data_lanes = 2;
  bus_cfg.phy_clk_src = MIPI_DSI_PHY_CLK_SRC_DEFAULT;
  bus_cfg.lane_bit_rate_mbps = board::kDsiLaneBitRateMbps;
  esp_lcd_dsi_bus_handle_t dsi_bus = nullptr;
  if (esp_lcd_new_dsi_bus(&bus_cfg, &dsi_bus) != ESP_OK) {
    Serial.println("DSI: bus create FAILED");
    return false;
  }

  // Panel reset, then the vendor init table over the DCS (DBI) channel. The
  // assert level is per-panel: the ST7701 resets LOW, the 5"'s HX8394 HIGH.
  const int rst_assert = board::kLcdRstActiveHigh ? HIGH : LOW;
  const int rst_release = board::kLcdRstActiveHigh ? LOW : HIGH;
  pinMode(board::kLcdRst, OUTPUT);
  digitalWrite(board::kLcdRst, rst_release);
  delay(10);
  digitalWrite(board::kLcdRst, rst_assert);
  delay(10);
  digitalWrite(board::kLcdRst, rst_release);
  delay(120);

  esp_lcd_dbi_io_config_t dbi_cfg = {};
  dbi_cfg.virtual_channel = 0;
  dbi_cfg.lcd_cmd_bits = 8;
  dbi_cfg.lcd_param_bits = 8;
  esp_lcd_panel_io_handle_t dbi_io = nullptr;
  if (esp_lcd_new_panel_io_dbi(dsi_bus, &dbi_cfg, &dbi_io) != ESP_OK) {
    Serial.println("DSI: DBI io create FAILED");
    return false;
  }
  for (size_t i = 0; i < sizeof(kDsiPanelInit) / sizeof(kDsiPanelInit[0]); ++i) {
    esp_lcd_panel_io_tx_param(dbi_io, kDsiPanelInit[i].cmd, kDsiPanelInit[i].data,
                              kDsiPanelInit[i].data_bytes);
    if (kDsiPanelInit[i].delay_ms) delay(kDsiPanelInit[i].delay_ms);
  }

  esp_lcd_dpi_panel_config_t dpi_cfg = {};
  dpi_cfg.virtual_channel = 0;
  dpi_cfg.dpi_clk_src = MIPI_DSI_DPI_CLK_SRC_DEFAULT;
  dpi_cfg.dpi_clock_freq_mhz = board::kDsiDpiClockHz / 1000000;
  dpi_cfg.pixel_format = LCD_COLOR_PIXEL_FORMAT_RGB565;
  dpi_cfg.num_fbs = 2;  // double buffer: scan one, render into the other
  dpi_cfg.video_timing.h_size = board::kLcdNativeW;
  dpi_cfg.video_timing.v_size = board::kLcdNativeH;
  dpi_cfg.video_timing.hsync_pulse_width = board::kDsiHsyncPulse;
  dpi_cfg.video_timing.hsync_back_porch = board::kDsiHsyncBack;
  dpi_cfg.video_timing.hsync_front_porch = board::kDsiHsyncFront;
  dpi_cfg.video_timing.vsync_pulse_width = board::kDsiVsyncPulse;
  dpi_cfg.video_timing.vsync_back_porch = board::kDsiVsyncBack;
  dpi_cfg.video_timing.vsync_front_porch = board::kDsiVsyncFront;
  dpi_cfg.flags.use_dma2d = true;
  if (esp_lcd_new_panel_dpi(dsi_bus, &dpi_cfg, &g_dpi_panel) != ESP_OK ||
      esp_lcd_panel_init(g_dpi_panel) != ESP_OK) {
    Serial.println("DSI: DPI panel create/init FAILED (framebuffer alloc?)");
    return false;
  }
  if (esp_lcd_dpi_panel_get_frame_buffer(g_dpi_panel, 2, (void**)&g_dsi_fb[0],
                                         (void**)&g_dsi_fb[1]) != ESP_OK) {
    Serial.println("DSI: get framebuffers FAILED");
    return false;
  }
  const size_t fb_bytes = static_cast<size_t>(board::kLcdNativeW) *
                          board::kLcdNativeH * sizeof(uint16_t);
  std::memset(g_dsi_fb[0], 0, fb_bytes);
  std::memset(g_dsi_fb[1], 0, fb_bytes);
  esp_cache_msync(g_dsi_fb[0], fb_bytes,
                  ESP_CACHE_MSYNC_FLAG_DIR_C2M | ESP_CACHE_MSYNC_FLAG_UNALIGNED);
  esp_cache_msync(g_dsi_fb[1], fb_bytes,
                  ESP_CACHE_MSYNC_FLAG_DIR_C2M | ESP_CACHE_MSYNC_FLAG_UNALIGNED);

  g_dsi_refresh_sem = xSemaphoreCreateBinary();
  esp_lcd_dpi_panel_event_callbacks_t cbs = {};
  cbs.on_refresh_done = dsi_refresh_done_cb;
  esp_lcd_dpi_panel_register_event_callbacks(g_dpi_panel, &cbs, nullptr);

#if SOC_PPA_SUPPORTED
  {
    ppa_client_config_t ppa_cfg = {};
    ppa_cfg.oper_type = PPA_OPERATION_SRM;
    if (ppa_register_client(&ppa_cfg, &g_ppa) == ESP_OK) {
      Serial.println("DSI: PPA hardware rotate/blit enabled");
    } else {
      g_ppa = nullptr;
      Serial.println("DSI: PPA unavailable — software rotate");
    }
  }
#endif

  Serial.printf("DSI: panel up %dx%d, double-buffered\n", board::kLcdNativeH,
                board::kLcdNativeW);
  // Backlight after the panel shows black: boost enable high (where a board
  // has one), then PWM full. Polarity is per-board (kBacklightActiveLow): the
  // 4.3's LEDC is inverted (duty 0 = full bright), the 5"'s is normal.
  if (board::kLcdBacklightEn >= 0) {
    pinMode(board::kLcdBacklightEn, OUTPUT);
    digitalWrite(board::kLcdBacklightEn, HIGH);
  }
  ledcAttach(board::kLcdBacklight, 5000, 8);  // 5 kHz, 8-bit PWM backlight
  ledcWrite(board::kLcdBacklight, board::kBacklightActiveLow ? 0 : 255);
#elif defined(BOARD_DISPLAY_RGB)
  // RGB parallel panel (e.g. 7B). The IO-extension I2C must come up first so we
  // can release the panel reset and turn the backlight on.
  Wire.begin(board::kI2cSda, board::kI2cScl);
  Wire.setClock(400000);
  const bool io_ok = io_extension().begin(board::kIoExtAddr);
  Serial.printf("RGB: IO extension @0x%02X on I2C(SDA=%d,SCL=%d): %s\n",
                board::kIoExtAddr, board::kI2cSda, board::kI2cScl,
                io_ok ? "ACK" : "NO ACK (backlight/reset won't work!)");
  io_extension().set(board::kIoExtLcdReset, false);
  delay(20);
  io_extension().set(board::kIoExtLcdReset, true);  // release reset
  delay(50);
  io_extension().set(board::kIoExtBacklight, true);  // backlight on early

  auto* rgbpanel = new Arduino_ESP32RGBPanel(
      board::kRgbDe, board::kRgbVsync, board::kRgbHsync, board::kRgbPclk,
      board::kRgbR[0], board::kRgbR[1], board::kRgbR[2], board::kRgbR[3], board::kRgbR[4],
      board::kRgbG[0], board::kRgbG[1], board::kRgbG[2], board::kRgbG[3], board::kRgbG[4],
      board::kRgbG[5],
      board::kRgbB[0], board::kRgbB[1], board::kRgbB[2], board::kRgbB[3], board::kRgbB[4],
      /*hsync_polarity=*/0, board::kRgbHsyncFront, board::kRgbHsyncPulse, board::kRgbHsyncBack,
      /*vsync_polarity=*/0, board::kRgbVsyncFront, board::kRgbVsyncPulse, board::kRgbVsyncBack,
      board::kRgbPclkActiveNeg, board::kRgbPclkHz, /*useBigEndian=*/false,
      /*de_idle_high=*/0, /*pclk_idle_high=*/0,
      /*bounce_buffer_size_px=*/board::kRgbBouncePx);
  g_gfx = new Arduino_RGB_Display(board::kLcdNativeW, board::kLcdNativeH, rgbpanel,
                                  board::kLcdRotation, /*auto_flush=*/true);
  if (!g_gfx->begin()) {
    Serial.println("RGB: RGB panel begin() FAILED (framebuffer alloc? PSRAM?)");
    return false;
  }
  Serial.printf("RGB: RGB panel up %dx%d\n", g_gfx->width(), g_gfx->height());
  g_gfx->fillScreen(0x0000);
  io_extension().set(board::kIoExtBacklight, true);  // backlight on
#else
  // SPI ST7789 panel (e.g. 2-inch).
  auto* bus = new Arduino_ESP32SPI(board::kLcdDc, board::kLcdCs, board::kLcdSclk,
                                   board::kLcdMosi, board::kLcdMiso, FSPI);
  g_gfx = new Arduino_ST7789(bus, board::kLcdRst, board::kLcdRotation, board::kLcdIps,
                             board::kLcdNativeW, board::kLcdNativeH);
  if (!g_gfx->begin(board::kLcdSpiHz)) return false;
  g_gfx->fillScreen(0x0000);
  ledcAttach(board::kLcdBacklight, 5000, 8);  // 5 kHz, 8-bit PWM backlight
  ledcWrite(board::kLcdBacklight, 255);
#endif

  lv_init();
  lv_tick_set_cb(tick_cb);

#if defined(BOARD_DISPLAY_DSI)
  // Logical (rotated) size: the UI is landscape on a native-portrait panel.
  const int w = board::kLcdNativeH;
  const int h = board::kLcdNativeW;
#else
  const int w = g_gfx->width();
  const int h = g_gfx->height();
#endif
  size_t buf_bytes = static_cast<size_t>(w) * kBufferLines * sizeof(lv_color_t);
#if defined(BOARD_DISPLAY_RGB) || defined(BOARD_DISPLAY_DSI)
  // Draw scratch: prefer a SMALL chunk in INTERNAL RAM. LVGL's software renderer
  // does read-modify-write blending per pixel, and over the PSRAM bus that made
  // full-page redraws (settings scrolls) crawl at ~4fps / 160ms render. A
  // 40-line internal chunk (~64KB on 800px) renders at SRAM speed with more,
  // cheaper chunks. Historical NO_MEM caution: an EARLIER build starved
  // esp_wifi_init with a 200-line internal buffer; 40 lines leaves that
  // headroom. Fallback: the old 200-line PSRAM buffer (slow but always fits).
  //
  // TEARING (why we accept it): the flow graph tears slightly because this is a
  // SINGLE framebuffer. A direct-ESP-IDF esp_lcd double-framebuffer + vsync swap
  // was built and tested on the 4.3B (preserved in a git stash on
  // feat/scale-integration). It works and is genuinely tear-free, BUT this panel
  // has no RAM of its own — the framebuffer lives in PSRAM and the panel scans it
  // continuously. Keeping BOTH framebuffers consistent for the *scrolling* graph
  // forces LVGL to re-render the whole screen every frame (DIRECT mode's cheap
  // partial-sync corrupts on a moving source -> out-of-order frames; FULL mode is
  // correct but full-screen), which on this PSRAM-bound panel is ~5 fps — worse
  // than this single-FB path's ~13 fps with cosmetic tearing. Verdict: not worth
  // it here. Viable tear-free routes if revisited: scroll the graph directly
  // inside both framebuffers (cheap: memmove the strip in each), or use an SPI
  // panel that has its own GRAM and self-refreshes.
  // PSRAM on purpose — see the kBufferLines comment: the internal variant
  // starved WiFi of its init heap.
  g_draw_buf = static_cast<lv_color_t*>(heap_caps_malloc(buf_bytes, MALLOC_CAP_SPIRAM));
  Serial.printf("RGB: LVGL draw buffer PSRAM %s (%u bytes)\n",
                g_draw_buf ? "ok" : "FAILED", static_cast<unsigned>(buf_bytes));
#else
  // SPI pushes this buffer over the bus via DMA -> must be DMA-capable.
  g_draw_buf = static_cast<lv_color_t*>(
      heap_caps_malloc(buf_bytes, MALLOC_CAP_DMA | MALLOC_CAP_INTERNAL));
#endif
  if (g_draw_buf == nullptr) return false;

