mlsorensen/Apollo2/src/platform_esp32/display.cpp
  lv_display_t* disp = lv_display_create(w, h);
#if defined(BOARD_DISPLAY_DSI)
  lv_display_set_flush_cb(disp, dsi_flush_cb);
#else
  lv_display_set_flush_cb(disp, flush_cb);
#endif
  lv_display_set_buffers(disp, g_draw_buf, nullptr, buf_bytes,
                         LV_DISPLAY_RENDER_MODE_PARTIAL);
  return true;
}

#if defined(BOARD_DISPLAY_DSI)
int Display::width() const { return board::kLcdNativeH; }   // landscape UI
int Display::height() const { return board::kLcdNativeW; }
#else
int Display::width() const { return g_gfx ? g_gfx->width() : 0; }
int Display::height() const { return g_gfx ? g_gfx->height() : 0; }
#endif

void Display::set_brightness(int percent) {
  if (percent < 0) percent = 0;
  if (percent > 100) percent = 100;
#if defined(BOARD_DISPLAY_RGB)
  // (DSI boards fall through to the LEDC path below with the SPI boards.)
  // Backlight dim is purely the IO-extension PWM register here. This board's PWM
  // is inverted-duty, so set_pwm writes 255-duty (100% = brightest, 0% = off).
  // The digital backlight enable is already on from begin(), so we don't re-touch
  // it per change (avoids a redundant write fighting the PWM on the same pin).
  io_extension().set_pwm(static_cast<uint8_t>(percent));
#elif defined(BOARD_DISPLAY_DSI)
  // Polarity per board_config: the 4.3's backlight PWM is ACTIVE-LOW (its BSP
  // configures LEDC with output_invert=1; verified on hardware — normal-
  // polarity duty leaves the screen black), the 5"'s is normal.
  const int duty = percent * 255 / 100;
  ledcWrite(board::kLcdBacklight, board::kBacklightActiveLow ? 255 - duty : duty);
#else
  ledcWrite(board::kLcdBacklight, percent * 255 / 100);
#endif
}

}  // namespace platform
